OpenFOAM-v2112/tank15-t153-M5-AMR/constant/fvOptions
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *

velocityDamping
{
    type            velocityDampingConstraint;
    active          true;
    selectionMode   all;
    UMax            50;
}
